const gen = () => {
document.querySelector("#nu").style.animationName += "input";
let luck = ["ዉሻ", "ንጉሥ", "የቄራ ሰራተኛ", "ጀግና", "አንበሳ", "አህያ", "ደደብ", "ተራ", "አዛባ", "ዝንብ ያርጋችሁ", "የግሚት ልጅ", "ቀፋፋ", "ግም አሳማ", "የአህያ ልጅ", "በጀመርያ ገላቹን ታጠቡ", "የአሳማ መሽኛ", "የዶርዜ ልጅ", "የ ወላሞ ልጅ", "ኩርንችት", "የዶርዜ ፊት", "ነገረኛ አንኮ", "ስንቂቱ", "ባለጌ ፓስተር", "ቡዳ", "ቱሉ", "ቅዘናም", "ጦጣ ፊት", "የውሻ ካካ", "ቅማላም ደሀ", "ቦርኮ", "ባለጌ ጦጣ", "መንደሬ", "የጎዳና አይጥ", "የሸተተ ፊት", "ራሞ", "ትላትል", "መርዝ", "ምስጥ ጉሬዛ", "ራስታ ዶርዜ", "ክፍ", "ዶማ", "የባርያ ዘር", "እጅግ ቀፋፋ", "ጎመኔ ጥርስ", "ሰላቢ", "የአይጥ ዱለት", "እንቁራሪት", "ጉሬዛ", "እይ ሞራልሽ", "እይ ሞራልህ", "ሰው እኮ አትመስልም/ይም", "ከካልሲክ/ሽ የሸተትክ/ሽ", "ዝንጀሮ", "ቂጥ ፊት", "የ ወላሞ ጀግና", "የ ጦጣ ኮሶ", "የኮሶ ትል", "የ ሴት ልጅ", "የ ወልሞ ፓንት", "አልሞት ባይ ተጋዳይ", "እይ 🤕ግማታም", "ምርጥ ሰው", "የ አመቱ ትል", "የ ሰው ጦጣ", "ዳንጎቴ ጭንቅላት", "የ ጉማሬ ፓንት", "ልክስክስ ወንጌላዊ", "ዝሙተኛ ቄስ", "ከ ምትዘሙት ዝመተ አንተ የ ጋሞ ወንጌላዊ", "ዝሙተኛ ትል", "ራሞ ትሎ", "ደርቁቻ","የ ወላይታ ትል", "የ ቦክሲንግ ካካ", "ውይ ይሄ ልጅ/ጂት ምንጉድ ነው እንዲያው ቅማላም ጦጣ", "የዝንጀሮ ቂጥ", "የ አራዳ ልጅ",  ];
if (document.querySelector("input").value == "") {
 document.getElementById("nu").innerHTML = "No number no future"
    //alert("nu")
}
else {
    document.querySelector("#nu").innerHTML = luck[Math.floor(Math.random() * luck.length + 1)]

}
console.log(luck.length)
    }
console.log(window.innerWidth)
